skrubis/VX1-esp32-web-interface/src/main.cpp
  // Set pins for SDMMC interface
  // This is a workaround since we can't pass pins directly to SD_MMC.begin()
  pinMode(SD_CLK, INPUT_PULLUP);
  pinMode(SD_CMD, INPUT_PULLUP);
  pinMode(SD_DAT0, INPUT_PULLUP);
  pinMode(SD_DAT1, INPUT_PULLUP);
  pinMode(SD_DAT2, INPUT_PULLUP);
  pinMode(SD_DAT3, INPUT_PULLUP);
  
  // Use a timeout for SD card initialization to prevent hanging
  
  // First try: 1-bit SDIO mode (more compatible)
  DBG_OUTPUT_PORT.println("Trying 1-bit SDIO mode...");
  bool sdBeginResult = false;
  
  // Set a task that will abort SD initialization if it takes too long
  Ticker sdTimeout;
  sdTimeout.once(5, []() {
    SD_MMC.end();
    DBG_OUTPUT_PORT.println("SD card initialization timeout!");
  });
  
  sdBeginResult = SD_MMC.begin("/sdcard", true, false, 40000, 5U);
  sdTimeout.detach(); // Cancel the timeout
  
  if (sdBeginResult) {
    uint64_t cardSize = SD_MMC.cardSize() / (1024 * 1024);
    uint64_t freeSpace = (SD_MMC.totalBytes() - SD_MMC.usedBytes()) / (1024 * 1024);
    DBG_OUTPUT_PORT.println("SD Card initialized in 1-bit SDIO mode");
    DBG_OUTPUT_PORT.printf("SD Card Size: %llu MB\n", cardSize);
    DBG_OUTPUT_PORT.printf("Free Space: %llu MB\n", freeSpace);
    haveSDCard = true;
  }
  // Second try: SPI mode fallback
  else {
    DBG_OUTPUT_PORT.println("SDIO mode failed, trying SPI mode...");
    SD_MMC.end();
    delay(500); // Give some time for cleanup
    
    // Set a timeout for SPI mode initialization
    sdTimeout.once(5, []() {
      SD.end();
      DBG_OUTPUT_PORT.println("SD card SPI initialization timeout!");
    });
    
    if (SD.begin(SD_DAT3)) { // Using CS pin (SD_DAT3/SS)
      sdTimeout.detach(); // Cancel the timeout
      uint64_t cardSize = SD.cardSize() / (1024 * 1024);
      uint64_t totalBytes = SD.totalBytes();
      uint64_t usedBytes = SD.usedBytes();
      uint64_t freeSpace = (totalBytes - usedBytes) / (1024 * 1024);
      
      DBG_OUTPUT_PORT.println("SD Card initialized in SPI mode");
      DBG_OUTPUT_PORT.printf("SD Card Size: %llu MB\n", cardSize);
      DBG_OUTPUT_PORT.printf("Free Space: %llu MB\n", freeSpace);
      haveSDCard = true;
    }
    else {
      sdTimeout.detach(); // Cancel the timeout
      DBG_OUTPUT_PORT.println("SD Card initialization failed in all modes");
      haveSDCard = false;
    }
  }
  
  DBG_OUTPUT_PORT.println("SD card initialization complete.");

  //Start SPI Flash file system
  SPIFFS.begin();

  //WIFI INIT
  #ifdef WIFI_IS_OFF_AT_BOOT
    enableWiFiAtBootTime();
  #endif
  WiFi.mode(WIFI_AP_STA);
  //WiFi.setPhyMode(WIFI_PHY_MODE_11B);
  WiFi.setSleep(false);
  WiFi.setTxPower(WIFI_POWER_19_5dBm);//25); //dbm
  WiFi.begin();
  sta_tick.attach(10, staCheck);

  MDNS.begin(host);

  config.load();

  if (config.getCanEnablePin() > 0) {
    pinMode(config.getCanEnablePin(), OUTPUT);
    digitalWrite(config.getCanEnablePin(), LOW);
  }

  OICan::Init(1, OICan::Baud500k, config.getCanTXPin(), config.getCanRXPin());

  updater.setup(&server);

  //SERVER INIT
  ArduinoOTA.setHostname(host);
  ArduinoOTA.begin();
  //list directory
  server.on("/list", HTTP_GET, handleFileList);

  server.on("/rtc/now", HTTP_GET, handleRTCNow);
  server.on("/rtc/set", HTTP_POST, handleRTCSet);
  server.on("/sdcard/list", HTTP_GET, handleSdCardList);
  server.on("/sdcard/deleteAll", HTTP_GET, handleSdCardDeleteAll);

  //load editor
  server.on("/edit", HTTP_GET, [](){
    if(!handleFileRead("/edit.htm")) server.send(404, "text/plain", "FileNotFound");
  });
  //create file
  server.on("/edit", HTTP_PUT, handleFileCreate);
  //delete file
  server.on("/edit", HTTP_DELETE, handleFileDelete);
  //first callback is called after the request has ended with all parsed arguments
  //second callback handles file uploads at that location
  server.on("/edit", HTTP_POST, [](){ server.send(200, "text/plain", ""); }, handleFileUpload);

  server.on("/wifi", handleWifi);
  server.on("/cmd", handleCommand);
  server.on("/canmap", handleCanMap);
  server.on("/fwupdate", handleUpdate);
  server.on("/baud", handleBaud);
  server.on("/version", [](){ server.send(200, "text/plain", "1.1.R"); });
  server.on("/nodeid", handleNodeId);
  server.on("/settings", handleSettings);

  //called when the url is not defined here
  //use it to load content from SPIFFS
  server.onNotFound([](){
    if(!handleFileRead(server.uri()))
    {
      server.sendHeader("Refresh", "6; url=/update");
      server.send(404, "text/plain", "FileNotFound");
    }
  });

  server.begin();

  MDNS.addService("http", "tcp", 80);
}

void binaryLoggingStart()
{
  if(createNextSDFile())
  {
    sendCommand(""); //flush out buffer in case just had power up
    delay(10);
    sendCommand("binarylogging 1"); //send start logging command to inverter
    delayMicroseconds(200);
    if (uart_readStartsWith("OK"))
    {
      uart_set_baudrate(INVERTER_PORT, 2250000);
      fastLoggingActive = true;
      DBG_OUTPUT_PORT.println("Binary logging started");
    }
    else //no response - in case it did actually switch but we missed response send the turn off command
    {
      dataFile.close();
      uart_set_baudrate(INVERTER_PORT, 2250000);
      uart_write_bytes(INVERTER_PORT, "\n", 1);
      delay(1);
      uart_write_bytes(INVERTER_PORT, "binarylogging 0", strlen("binarylogging 0"));
      uart_write_bytes(INVERTER_PORT, "\n", 1);
      uart_wait_tx_done(INVERTER_PORT, UART_TIMEOUT);
      uart_set_baudrate(INVERTER_PORT, 115200);
    }
    delay(10);
    uart_flush(INVERTER_PORT);
  }
}

void binaryLoggingStop()
{
  uart_write_bytes(INVERTER_PORT, "\n", 1);
  delay(1);
  uart_write_bytes(INVERTER_PORT, "binarylogging 0", strlen("binarylogging 0"));
  uart_write_bytes(INVERTER_PORT, "\n", 1);
  uart_wait_tx_done(INVERTER_PORT, UART_TIMEOUT);
  uart_set_baudrate(INVERTER_PORT, 115200);
  delay(100);
  uart_flush(INVERTER_PORT);
  //data should now have stopped so send command again and check response
  sendCommand("binarylogging 0");
  if (uart_readStartsWith("OK"))
  {
    uart_set_baudrate(INVERTER_PORT, 115200);
    fastUart = false;
    fastLoggingActive = false;
    dataFile.flush(); //make sure up to date
    dataFile.close();
    DBG_OUTPUT_PORT.println("Binary logging terminated");
  }
  else
  { //assume still logging so try again next time round
    uart_set_baudrate(INVERTER_PORT, 2250000);
  }
  delay(10);
  uart_flush(INVERTER_PORT);
}

void loop(void){
  // note: ArduinoOTA.handle() calls MDNS.update();
  server.handleClient();
  ArduinoOTA.handle();

  OICan::Loop();

  if((WiFi.softAPgetStationNum() > 0) || (WiFi.status() == WL_CONNECTED))
  { //have connections so stop logging
    startLogAttempt=0; //restart log attempts when next disconnected
    if(fastLoggingActive) //was it active last pass
      binaryLoggingStop();
  }
  else
  { //no connections so log
    if(fastLoggingActive) //already active, just carry on writing data
    {
      int spaceAvail = SDIO_BUFFER_SIZE - indexSDIObuffer;
      int bytesRead = uart_read_bytes(INVERTER_PORT, &SDIObuffer[indexSDIObuffer], spaceAvail, UART_TIMEOUT);
      if(bytesRead > 0)
      {
        indexSDIObuffer += bytesRead;
        if(indexSDIObuffer >= SDIO_BUFFER_SIZE)
        {
          dataFile.write(SDIObuffer, SDIO_BUFFER_SIZE);
          indexSDIObuffer = 0;
          blockCountSD++;
          if(blockCountSD >= FLUSH_WRITES)
          {
            blockCountSD = 0;
            dataFile.flush();
          }
        }
      }
    }
    else //not active so start
    {
      if(haveSDCard && fastLoggingEnabled && (startLogAttempt < 3) && (millis() > LOG_DELAY_VAL))
      {
        startLogAttempt++;
        binaryLoggingStart();
      }
    }
  }
}
